from enum import IntEnum


class OptimizationLevel(IntEnum):
    """Уровни оптимизации

    Определяют степень вмешательства компилятора в исходный код

    `O0` - Без оптимизаций. Код транслируется как есть. Полностью сохраняется структура и отладочная информация. Используется для тестов и диагностики

    `O1` - Лёгкая оптимизация. Убираются очевидные избыточности (пустые присваивания, лишние return, простые константные выражения). Структура остаётся неизменной, безопасно для отладки

    `O2` - Умеренная оптимизация. Удаляется мёртвый код, схлопываются простые выражения, инлайнится небольшие функции. Код становится компактнее, но сохраняет читаемость

    `O3` - Агрессивная оптимизация. Перестройка структуры, переиспользование переменных, глубокие свёртки. Код быстрее и меньше, но может быть труден для чтения и отладки
    """

    O0 = 0
    O1 = 1
    O2 = 2
    O3 = 3

    def __str__(self) -> str:
        return self.name.lower()
